Revit 2027 API
FamilyInstance.HasSpatialElementCalculationPoint Property
Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSpatialElementCalculationPoint { get; }
Public ReadOnly Property HasSpatialElementCalculationPoint As Boolean
	Get
public:
property bool HasSpatialElementCalculationPoint {
	bool get ();
}
member HasSpatialElementCalculationPoint : bool with get
Return Value
Boolean
True if this instance has a single SpatialElementCalculationPoint used as the search point, false otherwise.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace